# TP NoSQL

Prénom : Lorynda

Nom : Loufoua

Pour ce TP noté vous avez trois heures pour le réaliser et 48 heures pour le finir si besoin. Le rendu final est attendu pour dimanche 29 septembre 2024 à 23 h 59.

Vous serrez évalués sur les requêtes mais également sur la qualité et la propreté du code. Pour chaque question, une réponse présentant les résultats est attendue.

In [2]:
# installation des packages pandas et pymongo
!pip install -r requirements.txt --quiet
!pip install pymongo

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymongo in c:\users\lorynda.loufoua\appdata\roaming\python\python311\site-packages (4.9.1)
Requirement already satisfied: dnspython<3.0.0,>=1.16.0 in c:\users\lorynda.loufoua\appdata\roaming\python\python311\site-packages (from pymongo) (2.6.1)

In [35]:
import pymongo
import pandas as pd

URI = 'mongodb+srv://user_mongo:o2DngB8WaYYVhAjj@clusterbutsd.ak2ov.mongodb.net/?retryWrites=true&w=majority&appName=ClusterBUTSD'
client = pymongo.MongoClient(URI)
db = client.tp

# output the name of the collections in the database
print("Collections: ", db.list_collection_names())

Collections:  ['restaurants', 'movies']

1. Combien de films sont dans la base de données ?

In [10]:
rep1 = db.movies.count_documents({})
print(rep1)
#Il y 23 530 films au total dans la base de données

23530

2. Quel est le nombre moyen de votes par pays ? Trier les pays par nombre moyen de votes décroissant.

In [76]:
rep2 = db.movies.aggregate([
    {"$unwind": "$countries"},
    {"$group": {"_id": "$countries", "moyVotes" : {"$avg": "$imdb.votes"}}},
    {"$sort": { "moyVotes": -1 }}
])
pd.DataFrame(rep2)
#

                      _id       moyVotes
0                   Malta  210571.800000
1                 Bahamas  206061.000000
2             New Zealand   66589.269231
3    United Arab Emirates   53495.833333
4                     USA   35016.703663
..                    ...            ...
153                Kosovo     104.500000
154               Moldova     104.000000
155           North Korea      92.666667
156                Brunei      51.000000
157               Vanuatu       6.000000

[158 rows x 2 columns]

3. Donner la liste des différents genres de films.

In [12]:
rep3 = db.movies.distinct(key="genres")
print(rep3)

['Action',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Documentary',
 'Drama',
 'Family',
 'Fantasy',
 'Film-Noir',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

4. Combien de films ont une note IMDb supérieure à 8 ?

In [122]:
rep4 = db.movies.count_documents({"imdb.rating": {"$gt":8}})
print(rep4)
#1177 films ont une note supérieure  à 8

1177

5. Afficher le titre, l'année de sortie et les réalisateurs de tous les films (ne pas afficher l'ID).

In [74]:
rep5 = db.movies.find( {}, {"_id" :0, "title":1, "year":1 , "directors":1})
pd.DataFrame(rep5)

,title,directors,year
0,Intolerance: Love's Struggle Throughout the Ages,[D.W. Griffith],1916
1,The Poor Little Rich Girl,[Maurice Tourneur],1917
2,The Kid,[Charles Chaplin],1921
3,Miss Lulu Bett,[William C. de Mille],1921
4,Safety Last!,"[Fred C. Newmeyer, Sam Taylor]",1923
...,...,...,...
23525,Emelie,[Michael Thelin],2015
23526,Techo y comida,[Juan Miguel del Castillo],2015
23527,Nahid,[Ida Panahandeh],2015
23528,Coin Locker Girl,[Jun-hee Han],2015
23529,Tryapichnyy soyuz,[Mikhail Mestetskiy],2015

6. Afficher le titre et le plot des films réalisés par D.W. Griffith.

In [72]:
rep6 = db.movies.find( { "directors": "D.W. Griffith"}, {"_id" :0, "title":1, "plot":1})
pd.DataFrame(rep6)

,plot,title
0,"The story of a poor young woman, separated by ...",Intolerance: Love's Struggle Throughout the Ages
1,"A greedy tycoon decides, on a whim, to corner ...",A Corner in Wheat
2,"A frail waif, abused by her brutal boxer fathe...",Broken Blossoms or The Yellow Man and the Girl
3,The Civil War divides friends and destroys fam...,The Birth of a Nation

7. Quels sont les 5 acteurs les plus populaires (ceux qui ont joué dans le plus de films) ?

In [88]:
rep7 = db.movies.aggregate([ 
    {"$unwind":"$cast"},
    {"$group" : {"_id": "$cast", "nb_films": { "$sum": 1}}}, 
    {"$sort": {"nb_films": -1}},
    {"$limit":5}
])
pd.DataFrame(rep7)

                    _id  nb_films
0      Gèrard Depardieu        68
1        Robert De Niro        60
2         Michael Caine        52
3  Marcello Mastroianni        50
4         Max von Sydow        49

8. Quelles sont les 6 années avec le plus de films produits ?

In [100]:
rep8 = db.movies.aggregate([ 
    {"$sortByCount": "$year"},
    {"$limit":6}
])
pd.DataFrame(rep8)

    _id  count
0  2013   1220
1  2014   1147
2  2012   1109
3  2011   1040
4  2009    990
5  2010    970

9. Combien de films ont été réalisés avant l'année 2000 et ont une note IMDb supérieure à 7 ?

In [116]:
rep9 = db.movies.count_documents({
    "year": {"$lt": 2000},
    "imdb.rating": {"$gt": 7}
})
print(rep9)

4747

10. Donner les 20 réalisateurs qui ont réalisé le plus de films (afficher seulement leur nom et le nombre de films).

In [132]:
rep10 = db.movies.aggregate([
        { "$match": { "directors": { "$ne": None }}}, #ou $directors:$exists
        {"$sortByCount": "$directors"},
        {"$limit":20}
])
pd.DataFrame(rep10)

                       _id  count
0            [Woody Allen]     39
1          [Takashi Miike]     33
2          [Werner Herzog]     31
3       [Alfred Hitchcock]     31
4            [John Huston]     30
5        [Martin Scorsese]     29
6              [John Ford]     29
7           [Sidney Lumet]     29
8       [Steven Spielberg]     28
9          [Robert Altman]     27
10        [Clint Eastwood]     27
11         [Michael Apted]     27
12     [Steven Soderbergh]     26
13             [Spike Lee]     26
14        [Ingmar Bergman]     25
15  [Michael Winterbottom]     25
16          [George Cukor]     24
17       [Mario Monicelli]     24
18          [Ridley Scott]     24
19        [Joseph Sargent]     23

11. Quelle est la note IMDb moyenne des films sortis après 2010 ?

In [184]:
rep11 = db.movies.aggregate([
    {"$match": {"year": {"$gt": 2010}}},
    {"$group": {"_id": 0,"moyFilms": {"$avg": "$imdb.rating"}}}
])
pd.DataFrame(rep11)

   _id  moyFilms
0    0  6.544033

12. (bonus) Afficher les films dont le titre contient le mot "love".

In [ ]:
rep12 = db.movies.find( { "title": "love"})

13. (bonus) Afficher le titre des films ayant un score Rotten Tomatoes (viewer) supérieur à 75.